run/icoPhaseChangeVoF/testMarangoni/system/interface
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out the maximum cell value for one or more fields.

\*---------------------------------------------------------------------------*/

type            surfaces;

libs            ("libsampling.so");

writeControl    writeTime;

surfaceFormat   raw;

interpolationScheme cellPoint;

fields      (alpha.water);

surfaces
{
    isoSurface
    {
        type        isoSurface;
        interpolate true;
        isoField    alpha.water;
        isoValue    0.5;
    }
}

// ************************************************************************* //